{"pages":[{"title":"","text":"Yang Chen (Yang)Department of Marketing and Logistics Management, LTU &nbsp;&nbsp;&nbsp;&nbsp;I build this blog is for logging my life and technical problems in learning computer science, by the way, I can practice my English, because my English suck. &nbsp;&nbsp;&nbsp;&nbsp;If you want to contact me, you can send email to me, but I probably reply for few days. Books","link":"/about/index.html"},{"title":"link","text":"Personal sideshow link","link":"/link/index.html"}],"posts":[{"title":"2022 Goals","text":"&nbsp;&nbsp;&nbsp;&nbsp;This is my goal for 2022. I also set myself objectives last year, but unfortunately the results were unsatisfactory. So I will use the book “Ultralearning” in planning this year. I want to use the method of this book to learn computer science and English, the deadline is December 31, 2022, and then I will provide details about my plan. Goal list: Accepted by one of NTU CSIE and NYCU CSE. TOEIC 950 up Minimalist Exercise Habit &nbsp;&nbsp;&nbsp;&nbsp;During the first half of the year I have to complete my undergraduate degree, so probably no more time to learn. In the second half of the year, I will not work and then focus on learning. I estimate that I can put in about 3,800 hours on the plan this year. Why learn Computer Science and English?&nbsp;&nbsp;&nbsp;&nbsp;Computer science is one of the topics that interests me, but most of its resources are in English, which hampers my desire to learn. Now I’m about to get my degree, but I don’t know what job I want to do, so I decided to study computer science, and then apply for a research institute. And English is a basic skill in future. Learn what?&nbsp;&nbsp;&nbsp;&nbsp;I decided to use MIT’s CS curriculum. Because, it is logical to be planned that way, and this method was also tested by the author of this book. Moreover, the whole process is in English, it will let me more understanding the words on CS. Then I will be practicing historical questions and applying for graduate school at the end of this year. How to do&nbsp;&nbsp;&nbsp;&nbsp;I will use the test from the course’s website. If there is no provide testing, Umm… I haven’t made a decision yet. The final criteria will be based on whether or not to be accepted to the graduate school. More information about my Ultralearning plan will public in Notion, but I will just log with a simple way. The detail during the process I’ll make a writing after success.","link":"/2022/01/16/2022-GOALS/"}],"tags":[{"name":"Goals","slug":"Goals","link":"/tags/Goals/"}],"categories":[]}